{
  "name": "Sherief Badran",
  "github": "SheriefBadran",
  "projectrepo": "riastart2015",
  "projectdesc": "Probably an intruder in other projects...",
  "slack": "sherief",
  "presentation": "Sherief Badran, 36 years old.",
  "icon": "goblins$knight",
  "blogposts": [
    {
      "when": "2015-11-01 15:45",
      "url": "http://sheriefbadran.blogspot.se/2015/11/introduktionsinlagg.html",
      "title": "Presentation"
    },
    {
      "when": "2015-11-04 20:44",
      "url": "http://sheriefbadran.blogspot.se/2015/11/setup-and-build-process.html",
      "title": "Setup and build process"
    },
    {
      "when": "2015-11-21 20:56",
      "url": "http://sheriefbadran.blogspot.se/2015/11/react-framework-with-redux-and.html",
      "title": "React framework with Redux and Typescript"
    },
    {
      "when": "2015-12-13 23:00",
      "url": "http://sheriefbadran.blogspot.se/2015/12/functional-programming-with-javascript.html",
      "title": "Functional programming with javascript"
    }
  ],
  "pullrequests": [
    {
      "when": "2015-11-19",
      "url": "https://github.com/Pajn/Culinam/pull/7",
      "description": "feat: Dispatch a created order action at cashier that is red from Redux at kitchen side."
    },
    {
      "when": "2015-11-20",
      "url": "https://github.com/Pajn/Culinam/pull/11",
      "description": "feat: Creating logic for cashier, putting items from restaurant menu in cashier cart, and improvements on how cart handle items."
    },
    {
      "when": "2015-11-29",
      "url": "https://github.com/Grenmyr/2DV607-ria/pull/2",
      "description": "refactor: Changed store from createStore to a higher order store created with applyMiddleware. Currently authentication is done with a fake timeout async action creator (submitUser). Async actions now work thanks to thunk middleware, though next step could be replacing thunk with a promise middleware as a way to handle it the Redux-way."
    },
    {
      "when": "2015-11-30",
      "url": "https://github.com/Grenmyr/2DV607-ria/pull/3",
      "description": "feat: Firebase setup and auth now validates towards a firebase user."
    },
    {
      "when": "2015-11-30",
      "url": "https://github.com/Grenmyr/2DV607-ria/pull/4",
      "description": "refactor: All action-creators are now located in one file. The reducers are also adapted to that change. Application now make use of authentication state from both store and firebase. State is updated in userReducer and the submit component updates data according to state. Therefore some code setting state in the component was removed."
    },
    {
      "when": "2015-12-03",
      "url": "https://github.com/Grenmyr/2DV607-ria/pull/6",
      "description": "refactor: Making login and logout components dumber since they are in a smarter containter component auth. Login component does not know how to login, it just sends its form refs into the login handler function available via props. Its not possible to make login a functional presentational component since it contains refs. The logout component on the other hand should be as dumb as possible hence a presentational component."
    },
    {
      "when": "2015-12-03",
      "url": "https://github.com/Grenmyr/2DV607-ria/pull/7",
      "description": "feat: Implementing debouncing to prevent spamming on the login button which might cause unnecessary number of get-requests to firebase or any server api. Also first and tiny attempt for some functional javascript."
    },
    {
      "when": "2015-12-04",
      "url": "https://github.com/Grenmyr/2DV607-ria/pull/9",
      "description": "fix: Commented the debounce function on request. refactor: changing login component property name just to clarify what it acctually does."
    },
    {
      "when": "2015-12-06",
      "url": "https://github.com/Pajn/Culinam/pull/16",
      "description": "feat: 1. Improving how routing is done when navigating between dishes and drinks. 2. Bong an order of cart items from cashier to kitchen. A lot of lodgic remains in question of managing many cart orders including deletion of items from cart. refactor: 1. Attempt to make cart component slightly dumber, while cashier holds state and most of lodgic. 2. Created a Dish component used by cart, and will be used by others. Added some styles to cart component."
    },
    {
      "when": "2015-12-18",
      "url": "https://github.com/Grenmyr/2DV607-ria/pull/17",
      "description": "refactor: inline styles now refer to objects initialized and declared in component file. To long strings are devided to multiple lines with string interpolation. fix: Spinner component is now running within the card. refactor: Frequently used css is imported from customStyles."
    },
    {
      "when": "2015-12-22",
      "url": "https://github.com/MoombaDS/quest/pull/7",
      "description": "refactor: replacing two functions attemptEquip and attemptLookAt with one function runAttempt. Code in the two functions are extracted to a few other smaller in inputvalidationHelper.js. Tried to keep those new functions pure, with an additional function composing the smaller functions in order to obtain the desired behaviour."
    }
  ]
}
